docs/design/beamr/briefs/evidence/aion-encode-gc-defect/walls-lane-1/mutations/m2-remove-utf8-check.diff
diff --git a/crates/beamr/src/native/stdlib_stubs/json_bifs.rs b/crates/beamr/src/native/stdlib_stubs/json_bifs.rs
index 6f5d012..7b1bcf9 100644
--- a/crates/beamr/src/native/stdlib_stubs/json_bifs.rs
+++ b/crates/beamr/src/native/stdlib_stubs/json_bifs.rs
@@ -42,9 +42,6 @@ pub fn bif_json_encode_binary(args: &[Term], context: &mut ProcessContext) -> Re
         return Err(badarg());
     };
     let binary = BinaryRef::new(*term).ok_or_else(badarg)?;
-    if std::str::from_utf8(binary.as_bytes()).is_err() {
-        return Err(badarg());
-    }
     let escaped = escape_json_string(binary.as_bytes());
     context.alloc_binary(&escaped)
 }
