docs/design/beamr/briefs/evidence/aion-encode-gc-defect/walls-lane-1/mutations/m5-ensure-space-grow-only.diff
diff --git a/crates/beamr/src/gc/mod.rs b/crates/beamr/src/gc/mod.rs
index e613572..d7054b0 100644
--- a/crates/beamr/src/gc/mod.rs
+++ b/crates/beamr/src/gc/mod.rs
@@ -151,18 +151,7 @@ pub fn ensure_space(process: &mut Process, words: usize, live_x: usize) -> Resul
         return Ok(());
     }
 
-    match collect_minor_with_live(process, live_x) {
-        Ok(_stats) => {}
-        Err(GcError::HeapFull(_)) => {
-            collect_major(process)?;
-        }
-        Err(error) => return Err(error),
-    }
-
-    if process.heap().available() >= words {
-        return Ok(());
-    }
-
+    let _ = live_x;
     while process.heap().available() < words {
         process.heap_mut().grow_to_next_capacity_with_max()?;
     }
