docs/design/beamr/briefs/evidence/exit001-7a1242eb/mutations/m-token-requires-untaken.diff
diff --git a/crates/beamr/src/scheduler/exit_tombstones.rs b/crates/beamr/src/scheduler/exit_tombstones.rs
index 7523ab1..7ddbdd3 100644
--- a/crates/beamr/src/scheduler/exit_tombstones.rs
+++ b/crates/beamr/src/scheduler/exit_tombstones.rs
@@ -149,7 +149,9 @@ impl BoundedTombstones {
     /// already-dead source EXIT-001 D4 requires. `None` means no terminal
     /// transition has been recorded for `pid`.
     pub(super) fn finalized_reason(&self, pid: &u64) -> Option<ExitReason> {
-        self.outcomes.get(pid).map(|finalized| finalized.reason)
+        self.outcomes
+            .get(pid)
+            .and_then(|finalized| finalized.outcome.as_ref().map(|_| finalized.reason))
     }
 
     /// Register-then-check: arm a one-shot watch for `pid`, then consult the
