docs/design/beamr/briefs/evidence/exit001-7a1242eb/mutations/m-w3-first-watch-only.diff
diff --git a/crates/beamr/src/scheduler/exit_events.rs b/crates/beamr/src/scheduler/exit_events.rs
index 3e76e26..e12708e 100644
--- a/crates/beamr/src/scheduler/exit_events.rs
+++ b/crates/beamr/src/scheduler/exit_events.rs
@@ -254,6 +254,7 @@ impl ExitWatchRegistry {
             // one-shot slot absorbs duplicates by design, and send-and-drop
             // keeps the fire path non-blocking.
             let _ = sender.try_send((pid, reason));
+            break;
         }
     }
 
